{
  "name" : "wConsequence",
  "version" : "0.4.292",
  "engine" : "node >= 10.0.0",
  "description" : "Advanced synchronization mechanism. Asynchronous routines may use Consequence to wrap postponed result, what allows classify callback for such routines as output, not input, what improves analyzability of a program. Consequence may be used to make a queue for mutually exclusive access to a resource. Algorithmically speaking Consequence is 2 queues ( FIFO ) and a customizable arbitrating algorithm. The first queue contains available resources, the second queue includes competitors for this resources. At any specific moment, one or another queue may be empty or full. Arbitrating algorithm makes resource available for a competitor as soon as possible. There are 2 kinds of resource: regular and erroneous. Unlike Promise, Consequence is much more customizable and can solve engineering problem which Promise cant. But have in mind with great power great responsibility comes. Consequence can coexist and interact with a Promise, getting fulfillment/rejection of a Promise or fulfilling it. Use Consequence to get more flexibility and improve readability of asynchronous aspect of your application.",
  "license" : "MIT",
  "author" : "Kostiantyn Wandalen <wanalen@01.school>",
  "contributors" :
  [
    { "name" : "Kostiantyn Wandalen", "email" : "wanalen@01.school" },
    { "name" : "Volodymyr M.", "email" : "volodymyr.migdal@gmail.com" },
    { "name" : "Ihor O.", "email" : "iostashvxi@gmail.com" }
  ],
  "main" : "proto/dwtools/abase/l9/consequence/Consequence.s",
  "files" : [ "proto/dwtools/abase/l9", "proto/dwtools/Tools.s", "out" ],
  "scripts" : { "test" : "wtest .run 'proto/**' rapidity:-3", "docgen" : "wdocgen proto" },
  "repository" :
  {
    "type" : "git",
    "url" : "https://github.com/Wandalen/wConsequence.git"
  },
  "bugs" :
  {
    "url" : "https://github.com/Wandalen/wConsequence/issues"
  },
  "dependencies" :
  {
    "wTools" : "",
    "wProto" : "",
    "wCopyable" : "",
    "wprocedure" : ""
  },
  "devDependencies" : { "deasync" : "", "wTesting" : "", "wConsequence" : "file:." },
  "keywords" :
  [
    "wTools",
    "Callback",
    "Event",
    "Signal",
    "Mutex",
    "Semaphore",
    "Async",
    "Promise"
  ]
}
